### Pandas is open source library built on top of Numpy that provides high-performance data manipulation and analysis tools.
#### It is widely used in data science, data analysis, and machine learning tasks. 
#### Pandas introduces two key data structures: DataFrame and Series.


* Pandas allows for fast analysis , data cleaning and preparation.
* It excels in performance and productivity.
* has built in visualization features.
* it can work with data from wide variety of sources.

### Series:
A Series, as mentioned earlier, is a one-dimensional labeled array-like data structure. It can be seen as a single column of a DataFrame or a standalone data structure. Series can hold any data type and have an associated index. It is useful for performing operations on a single column or extracting a single dimension from a DataFrame.

### DataFrame:
A DataFrame is a two-dimensional labeled data structure that resembles a table or a spreadsheet. It consists of rows and columns, where each column can hold different data types (e.g., numeric, string, boolean). The rows are labeled with an index, and the columns are labeled with column names. DataFrame allows efficient data manipulation, slicing, filtering, merging, and aggregation. It is a powerful tool for data cleaning, exploration, and analysis.

In [1]:
import numpy as np
import pandas as pd

### Series 

* Series is very similar to Numpy array. It is build on top of Numpy array object.
* What differentiate Numpy array from Pandas series is that series can be accessed by index label(has acess labels)

### Creating a Series

You can convert a list,numpy array, or dictionary to a Series:

In [2]:
labels = ['a','b','c'] #list for labels
my_data = [10,20,30] #list of data
arr = np.array([10,20,30]) # Numpy array
d = {'a':10,'b':20,'c':30} #dictionaries

In [3]:
pd.Series(data = my_data) #gives series back with index and data

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data = my_data, index = labels) #Labelled index Series

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [9]:
# Even functions (although unlikely that you will use this)
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

## Using an Index

The key to using a Series is understanding its index. Pandas makes use of these index names or numbers by allowing for fast look ups of information (works like a hash table or dictionary).

Let's see some examples of how to grab information from a Series. Let us create two sereis, ser1 and ser2:

In [10]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])

In [11]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [12]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])

In [13]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [14]:
ser1['USA']

1

In [15]:
#Operations are then also done based off of index:/
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# Dataframes

* Dataframes is a collection of series that share the same index
* A DataFrame is a two-dimensional labeled data structure that resembles a table or a spreadsheet. 
* It consists of rows and columns, where each column can hold different data types (e.g., numeric, string, boolean).
* The rows are labeled with an index, and the columns are labeled with column names. 
* DataFrame allows efficient data manipulation, slicing, filtering, merging, and aggregation.
* It is a powerful tool for data cleaning, exploration, and analysis.

In [16]:
from numpy.random import randn

In [17]:
np.random.seed(101)

In [18]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [19]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [20]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [21]:
type(df['W'])

pandas.core.series.Series

In [22]:
type(df) #DataFrame is thus just a bunch of series

pandas.core.frame.DataFrame

In [23]:
#can also be selected this way like SQL but avoid it use bracket notation

df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [24]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [25]:
# creating a new column or adding a column to the existing data frame

df['V'] = df['W'] + df['Y']

In [26]:
df

          W         X         Y         Z         V
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [27]:
df.drop('V', axis =1) #dont forget to add axis =1 here

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
df #even after dropping the V column its still there when we check the Dataframe , hence use inplace

          W         X         Y         Z         V
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [29]:
# use inplace to make changes permanent, 
# this is because Pandas wants to confirm before dropping information and changes

df.drop('V', axis =1, inplace=True)

In [30]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
df.drop('E') # by default axis =0 hence no need to mention

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [32]:
df.drop('E', axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [33]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
# returns a tuple, Also note that its an attribute not a shape method just like that used earlier on Numpy array
df.shape

(5, 4)

In [35]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [36]:
# two ways of selecting rows; viz loc and iloc

df.loc['E']

W    0.190794
X    1.978757
Y    2.605967
Z    0.683509
Name: E, dtype: float64

In [37]:
type(df.loc['E'])

pandas.core.series.Series

In [38]:
type(df[['W','Z']])

pandas.core.frame.DataFrame

In [39]:
df.iloc[4]

W    0.190794
X    1.978757
Y    2.605967
Z    0.683509
Name: E, dtype: float64

In [40]:
df.loc['E']

W    0.190794
X    1.978757
Y    2.605967
Z    0.683509
Name: E, dtype: float64

In [41]:
df.loc['B','Y']

-0.8480769834036315

In [42]:
#note here we are assing lists of row and columns , in numpy array we used index slicing

df.loc[['A','B'],['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077

In [43]:
df.loc[['B','A'],['Y','X']]

          Y         X
B -0.848077 -0.319318
A  0.907969  0.628133

In [44]:
df.loc[['B','B'],['X','X']]

          X         X
B -0.319318 -0.319318
B -0.319318 -0.319318

### Conditional selection

In [45]:
df >0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [46]:
booldf = df >0

In [47]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [48]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [49]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [50]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [51]:
### Usually instead passing the entire dataframe you'll

In [52]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [53]:
df['W'] >0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [54]:
#Using the series to filter out rows based off of a column value
df[df['W'] >0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [55]:
# we got only the rows where this condition happened to be true, wont return C
# we dont get null values

df[df['W']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [56]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [57]:
df[df['W']>0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [58]:
df[df['W']>0][['Y']]

          Y
A  0.907969
B -0.848077
D -0.933237
E  2.605967

In [59]:
df[df['W']>0][['Y','Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
D -0.933237  0.955057
E  2.605967  0.683509

In [60]:
#For two conditions you can use | and & with parenthesis:
df[(df['W']>0) & (df['Y'] > 1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [61]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [62]:
df.reset_index()
#use inplace = True and pass into reset_index to make it permanent
# Note , old index became a column to the dataset

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [63]:
newind = 'CA NY WY OR CO'.split()

In [64]:
df['States'] = newind

In [65]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [66]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [67]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [68]:
df.set_index('States',inplace=True)

In [69]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [70]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [71]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [72]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

* Now let's show how to index this! For index hierarchy we use df.loc[],
* if this was on the columns axis, you would just use normal bracket notation df[]. 
* Calling one level of the index returns the sub-dataframe:

In [73]:
df.loc['G2']

          A         B
1  0.166905  0.184502
2  0.807706  0.072960
3  0.638787  0.329646

In [74]:
df.loc['G2'].loc[2]

A    0.807706
B    0.072960
Name: 2, dtype: float64

In [75]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [76]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [77]:
df.index.names

FrozenList([None, None])

In [78]:
df.index.names= ['Groups', 'Num']

In [79]:
df.index.names

FrozenList(['Groups', 'Num'])

In [80]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [81]:
# cross section functiom names xs. It returns the cross section of rows and columns from a Series/Dataframe
# used when we have multilevel indexing
df.xs('G2') # results equal to that of df.loc['G2']

            A         B
Num
1    0.166905  0.184502
2    0.807706  0.072960
3    0.638787  0.329646

In [82]:
df.xs(1,level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

* Multi-indexing in Python, particularly in the context of Pandas, refers to the ability to assign multiple levels of indices to a DataFrame or a Series. 
* It allows for hierarchical indexing, where each level of the index provides additional information about the data. 
* Multi-indexing is useful when dealing with datasets that have multiple dimensions or when you need to represent data with complex hierarchical structures.

* In Pandas, multi-indexing can be achieved using the MultiIndex class. 
* You can create a multi-index by passing a list of arrays or tuples to the MultiIndex.from_arrays() or MultiIndex.from_tuples() methods, respectively.
* Alternatively, you can specify the multi-index directly when creating a DataFrame or Series.

In [83]:
import pandas as pd

# Create multi-index
index = pd.MultiIndex.from_tuples([('A', 1), ('A', 2), ('B', 1), ('B', 2)])

# Create DataFrame with multi-index
df = pd.DataFrame(data=[[10, 20], [30, 40], [50, 60], [70, 80]], index=index, columns=['Column1', 'Column2'])

# Display the DataFrame
print(df)

     Column1  Column2
A 1       10       20
  2       30       40
B 1       50       60
  2       70       80

* In the above example, the DataFrame has a multi-index consisting of two levels:
* the first level represents groups 'A' and 'B', 
* while the second level represents subgroups 1 and 2. 
* This hierarchical indexing allows for more granular access and manipulation of data based on the specified levels.

### Zip function

* Moving on to the zip function, it is a built-in Python function that combines elements from multiple iterables into tuples. 
* The zip function takes in one or more iterables (such as lists, tuples, or strings) and returns an iterator that generates tuples by aggregating corresponding elements from each iterable.

In [84]:
names = ['Alice', 'Bob', 'Charlie']
ages = [25, 30, 35]
genders = ['Female', 'Male', 'Male']

# Combine the lists using zip
combined = zip(names, ages, genders)

# Display the combined tuples
for item in combined:
    print(item)

('Alice', 25, 'Female')
('Bob', 30, 'Male')
('Charlie', 35, 'Male')

In [85]:
type(combined)

zip

# Missing Data

* Handling missing values is an essential part of data cleaning and preprocessing. 
* Pandas provides several methods and functions to handle missing values effectively.

In [86]:
import numpy as np
import pandas as pd

In [87]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [88]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [89]:
df.dropna() #By default drops all the rows with nulls

     A    B  C
0  1.0  5.0  1

In [90]:
# Not permanent
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [91]:
df.dropna(axis=1) #drops all nulls columns

   C
0  1
1  2
2  3

In [92]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [93]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [94]:
df.fillna(value=df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [95]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## Identify Missing Values: 
First, you need to identify the missing values in your DataFrame. 
Pandas represents missing values as NaN (Not a Number) or None depending on the data type. 
You can use the isnull() method to check for missing values, which returns a DataFrame of the same shape with True at the locations of missing values and False elsewhere.

In [96]:
# Identify missing values
missing_values = df.isnull()

In [97]:
missing_values

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [98]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

## Drop Missing Values: 
If the missing values are deemed irrelevant or have little impact on your analysis, 
you can remove them using the dropna() method. 
By default, this method removes any rows containing missing values.

In [99]:
# Drop rows with missing values
df.dropna(inplace=True)

## Fill Missing Values: 
In situations where the missing values are significant or removing them would lead to data loss, you can fill them with appropriate values. The fillna() method allows you to replace missing values with a specified value or a calculated value, such as the mean or median of the column.

#### Fill missing values with a specified value
df.fillna(value, inplace=True)

#### Fill missing values with the mean of the column
df.fillna(df['column'].mean(), inplace=True)

#### Fill missing values with the median of the column
df.fillna(df['column'].median(), inplace=True)

### Interpolate Missing Values: 
If your data has a temporal or sequential nature, you can use interpolation to estimate missing values based on existing data. The interpolate() method fills missing values by interpolating between neighboring values.

In [100]:
# Interpolate missing values
df.interpolate(inplace=True)

In [101]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [102]:
# Interpolate missing values
df.interpolate(inplace=True)

df

data_types = df.dtypes

data_types

A    float64
B    float64
C      int64
dtype: object

### Replace Missing Values in Specific Columns: 
If you want to handle missing values only in specific columns, you can use the above methods on those columns specifically.

#### Drop missing values in specific columns
df.dropna(subset=['column1', 'column2'], inplace=True)

#### Fill missing values in specific columns with a specified value
df['column'].fillna(value, inplace=True)

#### Interpolate missing values in specific columns
df['column'].interpolate(inplace=True)

# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

* The "group by" functionality is available in various libraries in Python, but it is particularly prevalent in Pandas, a popular library for data manipulation and analysis. 
* Pandas provides the groupby() method, which allows you to group a DataFrame by one or more columns and perform operations within each group.

In [103]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [104]:
df = pd.DataFrame(data)

df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [105]:
# Now you can use the .groupby() method to group rows together based off of a column name. 
# For instance let's group based off of Company. 
# This will create a DataFrameGroupBy object:

In [106]:
df.groupby('Company')

In [107]:
# Saving this DataFrameGroupBy into a variable
by_comp = df.groupby("Company")

by_comp

In [108]:
# calling aggregate method over it
by_comp.mean()

/var/folders/jw/y0jbb83x57l04gj0jvqk3qm80000gn/T/ipykernel_77744/2904480904.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [109]:
by_comp.mean(numeric_only = True)

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

### Old approach with 'numeric_only' parameter (deprecated)
grouped = df.groupby('column_name', numeric_only=True)

### Updated approach to exclude non-numeric columns
numeric_cols = df.select_dtypes(include='number').columns
grouped = df.groupby('column_name')[numeric_cols]

In [110]:
# Find out the data types of columns
data_types = df.dtypes

data_types

Company    object
Person     object
Sales       int64
dtype: object

In [111]:
by_comp.std(numeric_only = True)

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [112]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [113]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [114]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [115]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [116]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [117]:
by_comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

# Merging, Joining, and Concatenating

There are 3 main ways of combining DataFrames together:
Merging, Joining and Concatenating.
In Pandas, merging refers to the process of combining two or more DataFrames based on a common key or index. It is a way to join or concatenate DataFrames together to create a new DataFrame that combines the data from multiple sources.

Pandas provides the merge() function, which allows you to perform various types of merges, such as inner join, left join, right join, and outer join. The merge() function compares the values of one or more columns (or indexes) between the DataFrames and combines the matching rows into a new DataFrame.

Here's a brief overview of the common types of merges in Pandas:
Merging: The merge() function in Pandas allows you to merge two DataFrames based on a common column or index. It performs similar to the SQL join operation, where you can specify different types of joins such as inner, outer, left, and right

merged_df = pd.merge(df1, df2, on='common_column')

In the above example, df1 and df2 are the two DataFrames being merged, and 'common_column' is the column name on which the merge is performed. You can also specify the type of join explicitly using the how parameter.

Concatenating: The concat() function is used to concatenate or stack DataFrames vertically or horizontally. It allows you to combine DataFrames along a particular axis (rows or columns). By default, concatenation is performed along axis 0 (rows).

concatenated_df = pd.concat([df1, df2])

Here's a brief overview of the common types of merges in Pandas:

Inner Join: An inner join returns only the matching rows from both DataFrames based on the common key. It keeps only the rows where the key value is present in both DataFrames.

merged_inner = pd.merge(df1, df2, on='common_key', how='inner')

Left Join: A left join returns all the rows from the left DataFrame and the matching rows from the right DataFrame. If there are no matching rows, it fills the missing values with NaN.

merged_left = pd.merge(df1, df2, on='common_key', how='left')

Right Join: A right join returns all the rows from the right DataFrame and the matching rows from the left DataFrame. If there are no matching rows, it fills the missing values with NaN.

merged_right = pd.merge(df1, df2, on='common_key', how='right')

Outer Join: An outer join returns all the rows from both DataFrames and fills the missing values with NaN where there are no matches.

merged_outer = pd.merge(df1, df2, on='common_key', how='outer')

In the above examples, df1 and df2 are the DataFrames you want to merge, and 'common_key' represents the column or index on which you want to perform the merge. The how parameter determines the type of merge to perform.

You can also merge on multiple columns by passing a list of column names to the on parameter. Additionally, Pandas allows you to merge on indexes using the left_index and right_index parameters.

Merging in Pandas is a powerful tool for combining data from different sources based on common keys or indexes. It enables you to bring together related data and perform various analyses and manipulations on the merged DataFrame.

In [144]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [145]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 

df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [146]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## Concatenation

Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use **pd.concat** and pass in a list of DataFrames to concatenate together:

In [121]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [122]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [149]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [124]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [125]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

## Merging

The **merge** function allows you to merge DataFrames together using a similar logic as merging SQL Tables together. For example:

In [153]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [155]:
pd.merge(left,right)

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [127]:
#Or to show a more complicated example:

In [128]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [129]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [130]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [131]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [132]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [133]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [134]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

## Joining
Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [135]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [136]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [137]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [138]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [139]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

## Operations

In [157]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [158]:
# conditional selection

df['col2'].unique()

array([444, 555, 666])

In [159]:
df['col2'].nunique()

3

In [162]:
len(df['col2'].unique())

3

In [160]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [164]:
df[df['col2']==444]

   col1  col2 col3
0     1   444  abc
3     4   444  xyz

In [165]:
df['col2']==444

0     True
1    False
2    False
3     True
Name: col2, dtype: bool

In [167]:
df[(df['col2']==444) & (df['col3']=='abc')]

   col1  col2 col3
0     1   444  abc

In [ ]:
# apply method